Prakritijain11/contiki_process/examples/cc26xx/cc26xx-web-demo/mqtt-client.c
  status = mqtt_subscribe(&conn, NULL, sub_topic, MQTT_QOS_LEVEL_0);

  if(status == MQTT_STATUS_OUT_QUEUE_FULL) {
  }
}
/*---------------------------------------------------------------------------*/
static void
publish(void)
{
  /* Publish MQTT topic in IBM quickstart format */
  int len;
  int remaining = APP_BUFFER_SIZE;
  char def_rt_str[64];
  bool b_isMoreData;
  ST_RAM_VALUES st_paramInfo;

  seq_nr_value++;

  buf_ptr = app_buffer;

//#if 0 iot_lab commented
  len = snprintf(buf_ptr, remaining,
                 "{"
                 "\"d\":{"
                 "\"myName\":\"%s\","
                 "\"Seq #\":%d,"
                 "\"Uptime (sec)\":%lu",
                 BOARD_STRING, seq_nr_value, clock_seconds());

  if(len < 0 || len >= remaining) {
    return;
  }

  remaining -= len;
  buf_ptr += len;


  /* Put our Default route's string representation in a buffer */
  memset(def_rt_str, 0, sizeof(def_rt_str));
  cc26xx_web_demo_ipaddr_sprintf(def_rt_str, sizeof(def_rt_str),
                                 uip_ds6_defrt_choose());

  len = snprintf(buf_ptr, remaining, ",\"Def Route\":\"%s\",\"RSSI (dBm)\":%d",
                 def_rt_str, def_rt_rssi);

  if(len < 0 || len >= remaining) {
    return;
  }
  remaining -= len;
  buf_ptr += len;
//#endif iot_lab commented
  memcpy(&def_route, uip_ds6_defrt_choose(), sizeof(uip_ip6addr_t));

  // Get the Parameter values from NV RAM
  CBRAM_ReadMemParams();

  do
  {
		b_isMoreData =  CBRAM_GetParameterValues( &st_paramInfo );

//		len = snprintf(buf_ptr, remaining,
//						"%s-%s-%s,", st_paramInfo.au8_descr, st_paramInfo.au8_unit,
//						st_paramInfo.au8_converted);
		len = snprintf(buf_ptr, remaining,
				",\"%s\":%s", st_paramInfo.au8_descr, st_paramInfo.au8_converted); /*IOT_LAB_Modified*/
		if(len < 0 || len >= remaining) {
		return;
		}
		remaining -= len;
		buf_ptr += len;

  }while ( b_isMoreData );

  //IOT_LAB_uncommented
  len = snprintf(buf_ptr, remaining, "}}");

  if(len < 0 || len >= remaining) {
    return;
  }

  mqtt_publish(&conn, NULL, pub_topic, (uint8_t *)app_buffer,
               strlen(app_buffer), MQTT_QOS_LEVEL_0, MQTT_RETAIN_OFF);

  mb_mqttPublishFinished = true;
 
}
/*---------------------------------------------------------------------------*/
static void
connect_to_broker(void)
{
  /* Connect to MQTT server */
  mqtt_status_t conn_attempt_result = mqtt_connect(&conn, conf->broker_ip,
                                                   conf->broker_port,
                                                   conf->pub_interval * 3);

  if(conn_attempt_result == MQTT_STATUS_OK) {
    state = MQTT_CLIENT_STATE_CONNECTING;
  } else {
    state = MQTT_CLIENT_STATE_CONFIG_ERROR;
  }
}
/*---------------------------------------------------------------------------*/
static void
state_machine(void)
{
  switch(state) {
  case MQTT_CLIENT_STATE_INIT:
    /* If we have just been configured register MQTT connection */
    mqtt_register(&conn, &mqtt_client_process, client_id, mqtt_event,
                  MQTT_CLIENT_MAX_SEGMENT_SIZE);

    /*
     * If we are not using the quickstart service (thus we are an IBM
     * registered device), we need to provide user name and password
     */
    if(strncasecmp(conf->org_id, QUICKSTART, strlen(conf->org_id)) != 0) {
      if(strlen(conf->auth_token) == 0) {
        state = MQTT_CLIENT_STATE_ERROR;
        break;
      } else {
        mqtt_set_username_password(&conn, "use-token-auth",
                                   conf->auth_token);
      }
    }

    /* _register() will set auto_reconnect. We don't want that. */
    conn.auto_reconnect = 0;
    connect_attempt = 1;

    /*
     * Wipe out the default route so we'll republish it every time we switch to
     * a new broker
     */
    memset(&def_route, 0, sizeof(def_route));

    state = MQTT_CLIENT_STATE_REGISTERED;
    /* Continue */
  case MQTT_CLIENT_STATE_REGISTERED:

    if(uip_ds6_get_global(ADDR_PREFERRED) != NULL) {
      /* Registered and with a public IP. Connect */
      connect_to_broker();
    }
    etimer_set(&publish_periodic_timer, CC26XX_WEB_DEMO_NET_CONNECT_PERIODIC);
    return;
    break;
  case MQTT_CLIENT_STATE_CONNECTING:

    leds_on(CC26XX_WEB_DEMO_STATUS_LED);
    ctimer_set(&ct, CONNECTING_LED_DURATION, publish_led_off, NULL);
    /* Not connected yet. Wait */
    break;
  case MQTT_CLIENT_STATE_CONNECTED:

    /* Don't subscribe unless we are a registered device */
	  /******************* NOTICE ******************/
	  // Comment out the following to SUBSCRIBE
    if(strncasecmp(conf->org_id, QUICKSTART, strlen(conf->org_id)) == 0) {
      state = MQTT_CLIENT_STATE_PUBLISHING;
    }
    /* Continue */
  case MQTT_CLIENT_STATE_PUBLISHING:

    /* If the timer expired, the connection is stable. */
    if(timer_expired(&connection_life)) {
      /*
       * Intentionally using 0 here instead of 1: We want RECONNECT_ATTEMPTS
       * attempts if we disconnect after a successful connect
       */
      connect_attempt = 0;
    }

    if(mqtt_ready(&conn) && conn.out_buffer_sent) {
      /* Connected. Publish */
      if(state == MQTT_CLIENT_STATE_CONNECTED) {
        subscribe();
        state = MQTT_CLIENT_STATE_PUBLISHING;
      } else {
        leds_on(CC26XX_WEB_DEMO_STATUS_LED);
        ctimer_set(&ct, PUBLISH_LED_ON_DURATION, publish_led_off, NULL);
        publish();
      }

#if CC26XX_WEB_DEMO_SHUTDOWN_MODE

	  if (   mb_mqttPublishFinished != true )
	  {
		  etimer_set(&publish_periodic_timer, conf->pub_interval);
	  } 
	  else
	  {
		  etimer_stop(&publish_periodic_timer);
		  MQTT_ShutdownTimerOn();
	  }
#else
	  etimer_set(&publish_periodic_timer, conf->pub_interval);
#endif



      /* Return here so we don't end up rescheduling the timer */
      return;
    } else {
      /*
       * Our publish timer fired, but some MQTT packet is already in flight
       * (either not sent at all, or sent but not fully ACKd).
       *
       * This can mean that we have lost connectivity to our broker or that
       * simply there is some network delay. In both cases, we refuse to
       * trigger a new message and we wait for TCP to either ACK the entire
       * packet after retries, or to timeout and notify us.
       */
 
